#include "2sem2.h"
typedef enum { F, T } boolean;


/* создаю тип данных, чтобы при выводе символов не было много пустых строк между символами
про подключение библиотеки с этим типом данных, на момент написания кода, я не знал */


void task2()
{
    boolean flag = T;
    printf("\nEnter the string: ");
    int a;
    a = getchar();
    while (a != '\n')
    {
        if ((a ==' ' || a=='\t') && flag == T)
        {
            putchar('\n');
            flag = F;
        }
        else
        {
            if (a !=' ' && a!='\t')
            {
                putchar(a);
                flag = T;
            }
        }
        a = getchar();
    }
    
}

/* собственно функция в которой я проверяю элемент строки на то символ она или нет, (так же проверя флаг),
если нет, то я перескакиваю на другую строку
одновременно меняя значение флага на ложь,(если флаг == ложь, а элемент равен пробелу или табу, то строку я не переношу
чтобы не было пустой строки(а то вывод будет огромный, да и не очень красивый) */ 